
using System.Collections.Generic;

namespace Meowzic.Core {
    /// <summary>
    /// プレイヤー
    /// + 曲(ソング)を知っている
    /// + 自分の知識でフレーズを繰り出す
    ///     + フレーズの引き出しが沢山あれば曲をこなしていける
    ///     + ヴァース、コーラスなど曲のパートに合わせて演奏を変化させてくる
    ///     + 他のプレイヤーの演奏を参考にしながら演奏を修正してくる
    /// + 音色変更やエフェクトのタイミングも知っている
    ///     + 演奏する楽器について責任を持つ
    /// + ライブラリは知りたくない
    /// </summary>
    abstract public class Player {

        ///////////////////////////////////////////////////////////////////////////////////////////////
        // Fields

        Song song;

        List<Phrase> phraseList;

        ///////////////////////////////////////////////////////////////////////////////////////////////
        // Constructor

        public Player(Song song) {
            this.song = song;
        }

        ///////////////////////////////////////////////////////////////////////////////////////////////
        // public Methods [verb]

        // 全ての Phrase を Build する

        public void Play() {
            onPlay();
        }

        ///////////////////////////////////////////////////////////////////////////////////////////////
        // protected Methods [verb]

        abstract protected void onPlay();

    }
}
